# tuple არის მონაცემთა კოლექჩია, რომელიც ინახავს რამდენიმე მნიშვნელობას ერთ ცვლადში
# tuple არის:
# 1) დალაგებული
# 2) შეუცვლელი (immutable)
# 3) შეიძლება შეიცავდეს სხვადასხვა ტიპის მონაცემებს

# tuple-ს ვიყენებთ მაშინ, როდესაც გვინდა დავიცვათ მონაცემები შეცვლისგან.

# list:
# იცვლება (mutable)
# იყენებს კუთხურ ფრჩხილებს []
# აქვს მრავალი მეთოდი (append, remove, pop, clear, sort, reverse...)

numbers = (1, 2, 3, 4, 5)

print(len(numbers)) #გამოიყენება ელემენტების რაოდენობის გასაგებად

print(numbers[0]) #გამოიყენება ელემენტზე წვდომისთვის

print(numbers.count(1)) #გამოიყენება ელემენტის გამოყენების რაოდენობის გასაგებად

print(numbers.index(3)) #გამოიყენება ელემენტის ინდექსის გასაგებად

# numbers.append(6)
# numbers.remove(2)
# nummbers.pop()

# ეს მეთოდები არ მუშაობს, რადგან:
# tuple არის შეუცვლელი (immutable)
# მასში ელემეტის დამატება, წაშლა ან შეცვლა არ შეიძლება

# set არის მონაცემთა კოლექცია, რომელიც:
# 1) არ ინახავს დუბლირებულ მნიშვნელობებს
# 2) არ არის დალაგებული
# 3) არის ცვლადი (mutable)

# set ხშირად გამოიყენება:
# 1) უნიკალური მნიშვნელობების შესანახად
# 2) ოპერაციების შესასრულებლად, როგორიცაა გაერთიანება, გადაკვეთა და სხვ.

# list: დალაგებული, შეიძლება შეიცავდეს დუბლირებულ მნიშვნელობებს
# set: არ არის დალაგებული, არ შეიცავს დუბლირებულ მნიშვნელობებს
# tuple: დალაგებული, უცვლელი

numbers_set = {1, 2, 3, 4, 5, 1, 2}

print(numbers_set) #გამოიყენება ელემენტების გასაგებად (დუბლირებული მნიშვნელობები არ იქნება)

numbers_set.add(6) #გამოიყენება ელემენტის დასამატებლად

numbers_set.remove(3) #გამოიყენება ელემენტის წასაშლელად

print(len(numbers_set)) #გამოიყენება ელემენტების რაოდენობის გასაგებად

# numbers_set[0] #set არ არის დალაგებული, ამიტომ ინდექსით წვდომა არ მუშაობს ინდექსი არ გააჩნია

