# task1
# sequence - ნიშნავს რომ ზემოდან სრულდება ზუსტად იმ რიგით როგორც არის დაწერილი
# iteration - გამოიყენება მაშინ როდესაც გვინდა გავიმეოროთ რაღაც ნაწილი კოდის შემოწმდეს სწორია თუ არა
# selection - გამოიყენება მაშინ როდესაც გვინდა გავაკეთოთ არჩევანი სხვადასხვა ვარიანტებს შორის

# task2
# for loop - ვიყენებთ მაშინ როდესაც რაღაც მოქმედების გამეორება გვსურს რამოდენიმეჯერ




# task3
# ამ ციკლში range გადაატარებს 0–დან 5-მდე და დაბეჭდავს 0,1,2,3,4
for i in range(5):
    print(i)

# ამ ციკლში range გადაატარებს 0–დან 2-მდე და დაბეჭდავს 0,1
for i in range(2):
    print(i)

# ამ ციკლში range გადაატარებს 0–დან 9-მდე და დაბეჭდავს 0,1,2,3,4,5,6,7,8
for i in range(9):
    print(i)

# task4
name = "giorgi"
# ამ ციკლში len(name) გამოითვლის სიმბოლოების რაოდენობას სტრინგში "giorgi" რომელიც არის 6
for i in range(len(name)):
    print(i)

name = "sandro"
# ამ ციკლში len(name) გამოითვლის სიმბოლოების რაოდენობას სტრინგში "sandro" რომელიც არის 6
for i in range(len(name)):
    print(i)

name = "garika"
# ამ ციკლში len(name) გამოითვლის სიმბოლოების რაოდენობას სტრინგში "garika" რომელიც არის 6
for i in range(len(name)):
    print(i)

# task5
# "123"  3 სიმბოლოსგან შედგება ამიტომ hello world დაიბეჭდება 3-ჯერ
for i in str(123):
    print("hello world")

# 45 გადაიქცევა "45"-ად და ციკლი ორჯერ გაეშვება
for i in str(45):
    print("hello world")

# "7890"  4 სიმბოლოსგან შედგება ამიტომ hello world დაიბეჭდება 4-ჯერ
for i in str(7890):
    print("hello world")



